{"input": "The length of the base of the trapezoid is 25 centimeters (cm), and the length of the top side is (a) centimeters (cm). If the distance between the two sides is 13 centimeters (cm), and the area of this trapezoid is 286 square centimeters (cm2), what is the correct number for (a)?", "label": "19"}
{"input": "Each child has some crayons and 24 apples. There are 18 children, and there are a total of 216 crayons. How many crayons does each child have?", "label": "12"}
{"input": "Josh has some yards of ribbon that is to be used equally to 6 gifts. Each gift will use 2 yards of ribbon. There will be 6 yards of ribbon left. How many yards of ribbon does Josh have initially?", "label": "18"}
{"input": "Given the standard equation of the parabola is $y^2=6x$,\n\n(I) Find the coordinates of the focus and the equation of the directrix;\n(II) Line $L$ passes through the known focus of the parabola and has a slope angle of $45^{\\circ}$, and the intersection points of the line $L$ and the parabola are $A$ and $B$. Find the length of $AB$.", "label": "12"}
{"input": "Given complex numbers $z_1=4+2i$ and $z_2=6+9i$, where $i$ is the imaginary unit, find the real part of the number $(z_1-z_2)i$.", "label": "-2"}
{"input": "Solve for \\( y \\) in the equation \\( \\frac{4}{7} \\cdot \\frac{1}{5} \\cdot y - 2 = 14 \\).", "label": "140"}
{"input": "3. Solve the equation\n\n$$\n2 x+2+\\operatorname{arctg} x \\cdot \\sqrt{x^{2}+1}+\\operatorname{arctg}(x+2) \\cdot \\sqrt{x^{2}+4 x+5}=0\n$$", "label": "-1"}
{"input": "A piece of plywood had a total area of 24 square feet, with a certain width. The length of the wood is 4 feet. What is the width of the wood?", "label": "6"}
{"input": "6. (7 points) Several sages lined up in a column. All of them wore either black or white caps. It turned out that among any 10 consecutive sages, there were an equal number of sages with white and black caps, while among any 12 consecutive sages - not an equal number. What is the maximum number of sages that could be\n\nAnswer: 15 sages.", "label": "15"}
{"input": "Kupptsov L.\n\nGiven an equilateral triangle $ABC$. A certain line, parallel to the line $AC$, intersects lines $AB$ and $BC$ at points $M$ and $P$ respectively. Point $D$ is the center of the equilateral triangle $PMB$, and point $E$ is the midpoint of segment $AP$. Find the angles of triangle $DEC$.", "label": "906030"}
{"input": "Find $n$ such that $2^6 \\cdot 3^3 \\cdot n = 10!$.", "label": "350"}
{"input": "A $4$ x $4$ square board is called $brasuca$ if it follows all the conditions:\n\n     • each box contains one of the numbers $0, 1, 2, 3, 4$ or $5$;\n     • the sum of the numbers in each line is $5$;\n     • the sum of the numbers in each column is $5$;\n     • the sum of the numbers on each diagonal of four squares is $5$;\n     • the number written in the upper left box of the board is less than or equal to the other numbers\nthe board;\n     • when dividing the board into four $2$ × $2$ squares, in each of them the sum of the four\nnumbers is $5$.\n\nHow many $\"brasucas\"$ boards are there?", "label": "462"}
{"input": "At a school dance, the ratio of boys to girls was 3:4, and the ratio of teachers to students was 1:9. If there were 108 girls and 20% of the boys were wearing blue shirts, while 25% of the teachers were males wearing blue shirts; how many people were wearing blue shirts at the dance?", "label": "21"}
{"input": "6. Given $p(x)=a x^{3}+b x^{2}+c x+d$ is a cubic polynomial, satisfying\n$$\np\\left(\\frac{1}{2}\\right)+p\\left(-\\frac{1}{2}\\right)=1000 p(0) \\text {. }\n$$\n\nLet $x_{1} 、 x_{2} 、 x_{3}$ be the three roots of $p(x)=0$. Then the value of $\\frac{1}{x_{1} x_{2}}+\\frac{1}{x_{2} x_{3}}+\\frac{1}{x_{1} x_{3}}$ is $\\qquad$", "label": "1996"}
{"input": "3. (10 points) Let $[x]$ denote the greatest integer not exceeding $x$, for example $[10.2]=10$. Then $\\left[\\frac{2017 \\times 3}{11}\\right]+\\left[\\frac{2017 \\times 4}{11}\\right]+\\left[\\frac{2017 \\times 5}{11}\\right]+\\left[\\frac{2017 \\times 6}{11}\\right]+\\left[\\frac{2017 \\times 7}{11}\\right]+\\left[\\frac{2017 \\times 8}{11}\\right]$ equals ـ. $\\qquad$", "label": "6048"}
{"input": "A cricket player has played 20 innings with a certain average of runs. He must make 200 runs in his next innings to increase his average of runs by 8. What was his average runs per innings before the next game?", "label": "32"}
{"input": "Below is the graph of a function, $y = h(x)$:\n```\n[asy]\nimport graph; size(8cm); real lsf=0.5; pen dps=linewidth(0.7)+fontsize(10); defaultpen(dps); pen ds=black; real xmin=-4.25,xmax=4.25,ymin=-7.25,ymax=6.25;\n\npen cqcqcq=rgb(0.75,0.75,0.75);\n\n/*grid*/ pen gs=linewidth(0.7)+cqcqcq+linetype(\"2 2\"); real gx=1,gy=1;\nfor(real i=ceil(xmin/gx)*gx;i<=floor(xmax/gx)*gx;i+=gx) draw((i,ymin)--(i,ymax),gs); for(real i=ceil(ymin/gy)*gy;i<=floor(ymax/gy)*gy;i+=gy) draw((xmin,i)--(xmax,i),gs);\n\nLabel laxis; laxis.p=fontsize(10);\n\nxaxis(\"\",xmin,xmax,Ticks(laxis,Step=1.0,Size=2,NoZero),Arrows(6),above=true); yaxis(\"\",ymin,ymax,Ticks(laxis,Step=1.0,Size=2,NoZero),Arrows(6),above=true);\nreal f1(real x){return 4.125-(x+0.5)^2/2;}\ndraw(graph(f1,-4.25,4.25),linewidth(1));\nclip((xmin,ymin)--(xmin,ymax)--(xmax,ymax)--(xmax,ymin)--cycle);\nlabel(\"$y=h(x)$\",(4.5,-6),E);\n[/asy]\n```\nIf the graph of $y = h(x - 5)$ is drawn on the same set of axes as the graph above, then the two graphs intersect at one point. What is the sum of the coordinates of that point?", "label": "6"}
{"input": "Find the number of complex solutions to:\n\\[\\frac{z^3 - 1}{z^2 + z - 6} = 0.\\]", "label": "3"}
{"input": "Cade had 87 marbles. He gave some marbles to Dylan and now has 79 marbles left. How many marbles did Cade give to Dylan?", "label": "8"}
{"input": "A fisherman catches 3 types of fish in his net.  There are 32 bass, 1/4 as many trout as bass, and double the number of blue gill as bass.  How many fish did the fisherman catch total?", "label": "104"}
{"input": "A bag contains fifteen balls, some of which are red and the rest of which are blue. When three balls are drawn at random at the same time, the probability that all three are red is $\\frac{1}{35}$. How many balls in the bag are red?", "label": "7"}
{"input": "I need to subtract 23 from a number, but I accidentally subtracted 32 and it turned out to be 25. How much do you get if you calculate it right?", "label": "34"}
{"input": "A number when multiplied by 13 is increased by 180. The number is 15. What is the difference between the product of the number and 13, and the original number?", "label": "180"}
{"input": "Murtha has decided to start a pebble collection. She collects one pebble on the first day and doubles her collection amount every alternate day. Every other day, she collects one more pebble than the previous day. Calculate the total number of pebbles she will have collected at the end of the fifteenth day.", "label": "152"}
{"input": "Jenny took a science quiz that contained 100 questions: 20 chemistry, 40 biology, and 40 physics. She answered $80\\%$ of the chemistry, $50\\%$ of the biology, and $55\\%$ of the physics questions correctly. She failed the quiz because she scored less than $65\\%$ overall. How many more questions would she have needed to answer correctly to get a $65\\%$ passing grade?", "label": "7"}
{"input": "The square shown is divided into 4 congruent rectangles by drawing three vertical lines. If the perimeter of the square is 144 units, what is the perimeter of one of the four congruent rectangles?\n[asy]\nsize(75); defaultpen(linewidth(0.8));\ndraw(unitsquare);\ndraw((0.25,0)--(0.25,1)); draw((0.5,0)--(0.5,1)); draw((0.75,0)--(0.75,1));\n[/asy]", "label": "90"}
{"input": "The number $852$ can be written as $21q + r$ where $q$ and $r$ are positive integers. What is the greatest possible value of $q - r$?", "label": "28"}
{"input": "20 peaches are in the basket. Some more peaches are put in the basket, making a total of 45 peaches. How many additional peaches were put in the basket?", "label": "25"}
{"input": "On a two-lane highway where each lane is one-way, cars travel in both lanes at the same constant speed but observe different safety rules for maintaining distance: in lane 1, the distance from the back of one car to the front of the next is exactly one car length for each 15 kilometers per hour of speed. In lane 2, the distance is one car length for each 10 kilometers per hour of speed. Assume each car is 5 meters long, and a camera by the side of the road counts the number of cars that pass in one hour. Let $N$ be the maximum whole number of cars that can pass in lane 1, and $M$ in lane 2 in one hour. Find the sum of the quotients when $N$ and $M$ are each divided by 10.", "label": "500"}
{"input": "13.105. On one of the tram lines, trams of a new design have started to operate. A trip of 20 km now takes 12 minutes less, as the average speed of the new design tram is 5 km/h higher than the average speed of the outdated design tram. How much time does the new design tram take for the trip and what is its average speed?", "label": "48"}
{"input": "Determine the exact value of\n\\[\n\\sqrt{\\left( 3 - \\cos^2 \\frac{\\pi}{9} \\right) \\left( 3 - \\cos^2 \\frac{2\\pi}{9} \\right) \\left( 3 - \\cos^2 \\frac{4\\pi}{9} \\right)}.\n\\]", "label": "0"}
{"input": "2. (2 points) Boys were collecting apples. Each collected either 10 apples or $10\\%$ of the total number of apples collected, and there were both types. What is the smallest number of boys there could have been?", "label": "6"}
{"input": "$P$ is a prime number, and $P^6 + 3$ is also a prime number. Then, $P^{10} + 3 =$ ?", "label": "1027"}
{"input": "If \\((ax+b)(bx+a)=35x^2+\\Box\\cdot x+35\\), where \\(a\\), \\(b\\), and \\(\\Box\\) are distinct integers, what is the minimum possible value of \\(\\Box\\), the coefficient of \\(x\\)?", "label": "74"}
{"input": "8. In triangle $A B C$ with $\\angle B=120^{\\circ}$, the angle bisectors $A A_{1}, B B_{1}, C C_{1}$ are drawn. Segment $A_{1} B_{1}$ intersects the angle bisector $C C_{1}$ at point M. Find $\\angle C B M$.\n\n#", "label": "30"}
{"input": "Antoine owns a strawberry farm that supplies strawberries to his local bakeries. The first bakery needs 2 sacks per week, another bakery needs a certain number of sacks, and the third bakery needs 12 sacks. He needs to supply 72 sacks of strawberries to all the bakeries in 4 weeks. How many sacks does the second bakery need per week?", "label": "4"}
{"input": "Janessa has a plan to give her brother Dexter his first collection of baseball cards. She currently has 4 cards in addition to the 13 that her father gave her. She ordered a collection of 36 cards from eBay. After inspecting the cards, she found 4 cards are in bad shape and decides to throw them away. She wants to keep 40% of the remaining good-condition cards for herself and give 50% to Dexter. The remaining 10% will be given to her cousin. How many cards did Janessa keep for herself?", "label": "19"}
{"input": "Fred and Sam are standing 35 miles apart and they start walking in a straight line toward each other at the same time. Fred walks at a certain speed and Sam walks at a constant speed of 5 miles per hour. Sam has walked 25 miles when they meet. What is Fred's walking speed in miles per hour?", "label": "2"}
{"input": "Let \\(a\\) and \\(b\\) be complex numbers such that\n\\[\n\\frac{a + b}{a - b} - \\frac{a - b}{a + b} = 0.\n\\]\nFind\n\\[\n\\frac{a^4 + b^4}{a^4 - b^4} - \\frac{a^4 - b^4}{a^4 + b^4}.\n\\]", "label": "0"}
{"input": "What is the greatest possible three-digit number that is divisible by 3, 6, and 4?", "label": "984"}
{"input": "vanessa , mike and sarah have missed a total of 17 days of school this year . vanessa and mike have missed 14 days total , and mike and sarah have missed 12 days total . how many days of school did vanessa miss alone ?", "label": "5"}
{"input": "For the school play, 40 rows of chairs were set up where there were 20 chairs in each row. If only 10 seats were not occupied, how many seats were taken?", "label": "790"}
{"input": "Let trapezoid $ABCD$ inscribed in a circle $O$, $AB||CD$. Tangent at $D$ wrt $O$ intersects line $AC$ at $F$, $DF||BC$. If $CA=5, BC=4$, then find $AF$.", "label": "4"}
{"input": "Aniyah has 6 times as many birthday candles as Ambika. If Ambika has four birthday candles, how many birthday candles will they have if they put the birthday candles together and shared them equally between themselves?", "label": "14"}
{"input": "In a division, the dividend is 689, the divisor is 36, and the quotient is 19. What is the remainder?", "label": "5"}
{"input": "A vessel of capacity 2 liters has 25% of alcohol and another vessel of capacity 6 liters has 50% alcohol. The total liquid of 8 liters was poured out into a vessel of a certain capacity, and the rest of the vessel was filled with water. The new concentration of the mixture is 35%. What is the capacity of the vessel the mixture was poured into?", "label": "10"}
{"input": "Since the townspeople requested that he makes a chocolate cake, he will need 306 lbs. of cocoa powder. If the mayor already gave him 259 lbs., how much cocoa powder does he still need?", "label": "47"}
{"input": "If k is an integer and 0.000010101 x 10 ^ k is greater than 10000, what is the least possible value of k?", "label": "9"}
{"input": "11. A Trip for Milk. Anton went to a dairy store. He had no money, but he had empty bottles - six one-liter bottles (worth 20 kopecks each) and six half-liter bottles (worth 15 kopecks each). In the store, there was milk sold by the liter for 22 kopecks. What is the maximum amount of milk he could bring home? He had no other containers besides the empty bottles.", "label": "5"}
{"input": "Two trains are moving in the same direction at 90 kmph and 36 kmph. The faster train crosses a man in the slower train in 29 seconds. What is the length of the faster train?", "label": "435"}
{"input": "The planning committee at a conference has 12 members. Exactly five of these members are teachers. A five-person subcommittee with at least one member who is a teacher must be formed from the members of the planning committee. How many distinct subcommittees are possible?", "label": "771"}
{"input": "In order to effectively implement the \"double reduction\" work and truly reduce the burden and improve the quality, many schools attach great importance to students' physical exercise and hold sports competitions irregularly. It is known that in a football match, the scoring rules are as follows: winning a game earns $3$ points, drawing a game earns $1$ point, losing a game earns $0$ points. If Team A played $5$ games, lost $1$ game, and scored more than $7$ points, then Team A has won at least ____ games.", "label": "2"}
{"input": "Find all solutions to the equation \\(\\sqrt{5 - 4z} = 7\\). Express your answer as a common fraction.", "label": "-11"}
{"input": "## Task A-4.1.\n\nDetermine all natural numbers $m$ for which $m! + 8$ is a power of some prime number.", "label": "145"}
{"input": "Last year, some people were born in a country, and 16,320 people immigrated to it. 106,491 new people began living in the country last year. How many people were born in the country?", "label": "90171"}
{"input": "Convert $2200_{10}$ to base 9.", "label": "30149"}
{"input": "The speed of a boat in still water is 21 km/hr and the rate of current is 8 km/hr. The distance travelled downstream in some minutes is 6.283333333333333 km. How many minutes did it take to travel downstream?", "label": "13"}
{"input": "Rationalize the denominator of the expression \\(\\frac{1}{\\sqrt{3} + \\sqrt{5} + \\sqrt{11}}\\), and express your answer in the form \n\\[\n\\frac{A\\sqrt{B} + C\\sqrt{D} + E\\sqrt{F} + G\\sqrt{H}}{I},\n\\]\nwhere everything is in simplest radical form and the fraction is in lowest terms, and \\(I\\) is positive. What is \\(A + B + C + D + E + F + G + H + I\\)?", "label": "116"}
{"input": "When Xiao Ming calculated the polynomial $M$ minus the polynomial $2x^{2}y-3xy+1$, he mistakenly added the polynomial instead. The result he obtained was $2x^{2}y-xy$.  \n$(1)$ Please help Xiao Ming find the polynomial $M$;  \n$(2)$ For the polynomial $M$ obtained in $(1)$, when $x=-1$ and $y=2$, find the value of the polynomial $M$.", "label": "-5"}
{"input": "Find the number of positive integers $n$, $1 \\le n \\le 2000$, for which the polynomial $x^3 + x^2 - n$ can be factored as the product of three linear factors with integer coefficients, and $n$ is a multiple of 3.", "label": "31"}
{"input": "Find the sum of all positive integers such that their expression in base $3$ digits is the reverse of their expression in base $9$ digits. Express your answer in base $10$.", "label": "3"}
{"input": "Suppose a variable force $F(x)$ acts on a particle $M$, causing $M$ to move along the positive direction of the $x$-axis from $x=0$ to $x=6$. Given that $F(x)=x^{2}+1$ and its direction is the same as the positive direction of the $x$-axis, the work done by the variable force $F(x)$ on the particle $M$ is ________ ($J(x)$ unit: $m$; Force unit: $N$).", "label": "78"}
{"input": "Given that $m$ is a root of the equation $x^{2}-x-3=0$, then the algebraic expression $m^{2}-m-2$ is equal to ______.", "label": "1"}
{"input": "Given a sequence $\\{a_n\\}$ that satisfies $a_1=0$ and $a_{n+1}=a_n+2n$, what is the value of $a_{27}$?", "label": "702"}
{"input": "A certain water plant's reservoir has 400 tons of water at the beginning of each day at midnight. While supplying water to residents, it also pumps water into the reservoir at a rate of 60 tons per hour. The total amount of water supplied to residents within $t$ hours is $120\\sqrt{6t}$ $(0 \\leqslant t \\leqslant 24)$.\n\n$(1)$ At what time of the day is the amount of water in the reservoir at its minimum?\n\n$(2)$ If the amount of water in the reservoir is no more than 80 tons, water supply tension occurs. How many hours in a day does this tension occur?", "label": "8"}
{"input": "69 persons can repair a road in 12 days, working 5 hours a day. A different number of persons, working 6 hours a day, can complete the work in 23 days. How many persons are in the second group?", "label": "30"}
{"input": "Triangle $ ABC$ has $ AC \\equal{} 450$ and $ BC \\equal{} 300$. Points $ K$ and $ L$ are located on $ \\overline{AC}$ and $ \\overline{AB}$ respectively so that $ AK \\equal{} CK$, and $ \\overline{CL}$ is the angle bisector of angle $ C$. Let $ P$ be the point of intersection of $ \\overline{BK}$ and $ \\overline{CL}$, and let $ M$ be the point on line $ BK$ for which $ K$ is the midpoint of $ \\overline{PM}$. If $ AM \\equal{} 180$, find $ LP$.", "label": "120"}
{"input": "Let $ABCD$ and $BCFG$ be two faces of a cube with $AB=10$. A beam of light emanates from vertex $A$ and reflects off face $BCFG$ at point $P$, which is 3 units from $\\overline{BG}$ and 4 units from $\\overline{BC}$. The beam continues to be reflected off the faces of the cube. Calculate the length of the light path from the time it leaves point $A$ until it next reaches a vertex of the cube, expressed in the form $m\\sqrt{n}$, where $m$ and $n$ are integers, and $n$ is not divisible by the square of any prime.", "label": "55"}
{"input": "A right-angled triangle with integer side lengths has one side with length 605 . This side is neither the shortest side nor the longest side of the triangle. What is the maximum possible length of the shortest side of this triangle?", "label": "528"}
{"input": "Four. (50 points) Let $S \\subseteq\\{1,2,3, \\cdots, 100\\}$. It is known that for any two distinct elements $a, b$ in $S$, there exist a positive integer $k$ and two distinct elements $c, d$ in $S$ (which may equal $a$ or $b$), such that $c<d$, and $a+b=c^{k} d$. Find the maximum number of elements in the set $S$.\n\n保留源文本的换行和格式，直接输出翻译结果如下：\n\nFour. (50 points) Let $S \\subseteq\\{1,2,3, \\cdots, 100\\}$. It is known that for any two distinct elements $a, b$ in $S$, there exist a positive integer $k$ and two distinct elements $c, d$ in $S$ (which may equal $a$ or $b$), such that $c<d$, and $a+b=c^{k} d$. Find the maximum number of elements in the set $S$.", "label": "48"}
{"input": "3. A circle is circumscribed around an acute-angled triangle $A B C$. Point $K$ is the midpoint of the smaller arc $A C$ of this circle, and point $L$ is the midpoint of the smaller arc $A K$ of this circle. Segments $B K$ and $A C$ intersect at point $P$. Find the angle between the lines $B C$ and $L P$, given that $B K = B C$.", "label": "90"}
{"input": "If A, B, and C together can finish a piece of work in 4 days, A alone in 12 days, and B in 24 days, then how many days can C alone finish the work?", "label": "8"}
{"input": "The maximum value of the determinant $$\\begin{vmatrix} 12\\cos\\left( \\frac {\\pi}{2}+x \\right) & \\tan x \\\\ 5\\cos x & \\cot(\\pi-x) \\end{vmatrix}$$ is _______.", "label": "13"}
{"input": "Point \\( P(5, 10) \\) is the midpoint of line segment \\( \\overline{CD} \\). If point \\( C \\) has coordinates \\( (11, 4) \\), what is the sum of the coordinates of point \\( D \\)?", "label": "15"}
{"input": "If the perimeter of a rectangular garden is 700 m and its breadth is 100 m, what is the length of the garden?", "label": "250"}
{"input": "Ethan and Arianna are running a 5 km long race. Ethan runs at a constant speed of 10 km/h, while Arianna's average speed is 8 km/h. If they start the race at the same time, how far apart are they when Ethan finishes?", "label": "5"}
{"input": "Martin strolled to Lawrence's house. It took Martin 6 hours to get there, and he went at a speed of 2 miles per hour. How far is it from Martin's house to Lawrence's house?", "label": "12"}
{"input": "Five tutors – Evan, Fiona, George, Hannah, and Ian – are working in the school math lab. Their schedules are as follows: Evan works every fifth school day, Fiona works every sixth school day, George works every ninth school day, Hannah works every eighth school day, and Ian works every tenth school day. Today, all five tutors are working together in the math lab. How many school days from today will they next all be together tutoring in the lab?", "label": "360"}
{"input": "The Lucas numbers $L_n$ are defined by $L_0 = 2, L_1 = 1$, and $L_n = L_{n-1} + L_{n-2}$ for each $n \\geq 2$. Calculate the units digit of $L_{L_9}$.", "label": "7"}
{"input": "## Task A-1.1.\n\nDetermine all triples of consecutive odd natural numbers whose sum of squares is equal to a four-digit number with all digits being the same.", "label": "414345"}
{"input": "Lizette scored 92 on her third quiz, giving her an average of 94 for the first three quizzes. Each of these quizzes counts for 15% of her final grade. Then, she takes two more quizzes worth 20% each towards her final grade, both scoring above her current average. What is Lizette's new weighted average including all five quizzes?", "label": "94"}
{"input": "Last year, Department Store X had a sales total for December that was some multiple of the average (arithmetic mean) of the monthly sales totals for January through November. The sales total for December was 0.3125 of the sales total for the year. What was the multiple?", "label": "5"}
{"input": "Paris has two million inhabitants. A human being has, at most, 600000 hairs on their head. What is the largest number of Parisians that we can hope to find who have exactly the same number of hairs on their head?", "label": "4"}
{"input": "excluding stoppages , the speed of a train is 45 kmph and including stoppages it is 30 kmph . of how many minutes does the train stop per hour ?", "label": "20"}
{"input": "Find all values of $a$ such that the points $(0,0,0), (1,a,2a), (2,2,a), (a,4,1)$ are coplanar.", "label": "-1"}
{"input": "Given the function \\( g(x) = \\frac{3x - 4}{x - 3} \\), the inverse \\( g^{-1}(x) \\) can be expressed in the form \\( g^{-1}(x) = \\frac{ax + b}{cx + d} \\). Determine the value of \\( \\frac{a}{c} \\).", "label": "3"}
{"input": "Mrs. Hilt has 40 markers. They are divided equally into some packages. There are 5 markers in each package. How many packages are there?", "label": "8"}
{"input": "There were four jars of candy in the cabinet: peanut butter, grape, banana, and coconut candies. The jar of peanut butter candy had 4 times as much candy as the jar of grape candy. The jar of grape candy had 5 more pieces of candy than the jar of banana candy. The amount of candy in the jar of coconut candy was in a 3:2 ratio with the amount in the banana jar. How many pieces of candy did the peanut butter jar have if the banana jar had 43?", "label": "192"}
{"input": "Consider a sequence of integers \\(a_1, a_2, a_3, \\ldots\\) where \\(a_n = a_{n - 1} - a_{n - 2}\\) for each \\(n \\ge 3.\\) Suppose the sum of the first 1014 terms of this sequence is 1643, and the sum of the first 1643 terms is 1014. Find the sum of the first 2021 terms of this sequence.", "label": "1643"}
{"input": "5. [5 points] Given the numbers $\\log _{\\sqrt{29-x}}\\left(\\frac{x}{7}+7\\right), \\log _{(x+1)^{2}}(29-x), \\log _{\\sqrt{\\frac{x}{7}+7}}(-x-1)$. For which $x$ are two of these numbers equal, and the third one greater than them by 1?", "label": "-7"}
{"input": "Evaluate $\\log_\\frac{1}{2} 32$.", "label": "-5"}
{"input": "If the sum of the monomials $x^{2}y^{m}$ and $x^{n}y^{3}$ is still a monomial, then $m+n=\\_\\_\\_\\_\\_\\_.$", "label": "5"}
{"input": "If some number to the power of x - the same number to the power of (x - 2) = 3 (2 to the 11), and the value of x is 13, what is the base number?", "label": "2"}
{"input": "Calculate: $-2^{-1} \\times (-8) + (2022)^{0} - \\sqrt{9} - |-4|$.", "label": "-3"}
{"input": "Simplify and find the value of: $5x^2y-[3xy^2-2(3xy^2-\\frac{7}{2}x^2y)]$, where $|2+y|+(x-1)^{2}=0$.", "label": "16"}
{"input": "A man's speed with the current is 20 kmph and the speed of the current is 1 kmph. What is the man's speed against the current?", "label": "18"}
{"input": "Set W consists of all the prime numbers between a certain number and 25. The range of set W is 12. What is the lower limit of the range for set W?", "label": "7"}
{"input": "A, B and C rent a pasture. A puts 10 oxen for 7 months, B puts 12 oxen for some months and C puts 15 oxen for 3 months for grazing and the rent of the pasture is Rs. 175. C should pay Rs. 44.99999999999999 as his share of rent. For how many months did B put his oxen for grazing?", "label": "5"}
{"input": "What is the sum of the first 6 prime numbers?", "label": "41"}
{"input": "For how many values of the digit $A$ is it true that $75$ is divisible by $A$ and $282{,}1A4$ is divisible by $4$?", "label": "1"}
{"input": "7. (6 points) Using 64 small cubes, each with a volume of 1 cubic meter, to form a large cube, if the 8 small cubes at the vertices of the large cube are removed, then the surface area of the resulting geometric body is $\\qquad$ square meters.", "label": "96"}
{"input": "Charley bought 30 pencils. She lost some pencils while moving to school, and of course, also lost 1/3 of the remaining pencils because she wasn't very good at keeping track of pencils. She currently has 16 pencils. How many pencils did she lose while moving to school?", "label": "6"}
{"input": "The hobby store normally sells 21,122 trading cards per month. In June, the hobby store sold some more trading cards than normal. If the hobby store sold the regular number of trading cards in July, the hobby store sold 46,166 trading cards in June and July combined. How many more trading cards did the hobby store sell in June than normal?", "label": "3922"}
{"input": "Find the integer $n$, $0 \\le n \\le 180$, such that $\\cos n^\\circ = \\cos 942^\\circ$.", "label": "138"}
{"input": "Rationalize the denominator of $\\frac{7}{3 + \\sqrt{8} + \\sqrt{2}}$. The answer can be written as $\\frac{A\\sqrt{B} + C\\sqrt{D} + E}{F}$, where $A$, $C$, $E$, and $F$ are integers, $F$ is positive, and $B$ and $D$ are not divisible by the square of any prime. If the greatest common divisor of $A$, $C$, $E$, and $F$ is 1, find $A+B+C+D+E+F$.", "label": "0"}
{"input": "Our expanded football team now has 15 members, of which 5 are strong enough to play offensive lineman. A starting lineup consists of two offensive linemen, a quarterback, a running back, and a wide receiver. In how many ways can we choose this starting lineup?", "label": "17160"}
{"input": "Triangle $ABC$ has side lengths $AB=231$, $BC=160$, and $AC=281$.  Point $D$ is constructed on the opposite side of line $AC$ as point $B$ such that $AD=178$ and $CD=153$.  Compute the distance from $B$ to the midpoint of segment $AD$.", "label": "168"}
{"input": "If $\\frac{3+bi}{1-i}=a+bi$ ($a,b$ are real numbers, $i$ is the imaginary unit), then $a+b=$ ______.", "label": "3"}
{"input": "If the function $f(x)$ satisfies: for any real numbers $a$ and $b$, $f(a+b)=f(a)f(b)$, and $f(1)=1$, then what is the value of $\\frac{f(2)}{f(1)} + \\frac{f(3)}{f(2)} + \\frac{f(4)}{f(3)} + \\frac{f(5)}{f(4)} + \\ldots + \\frac{f(2011)}{f(2010)} = \\_\\_\\_\\_\\_\\_$.", "label": "2010"}
{"input": "During a family celebration, the Smith family decides to give five of their children new tablets, each with a unique service provider. If there are 25 service providers available, how many different combinations are possible for the Smith family to assign these providers to their children?", "label": "5103000"}
{"input": "Find the sum of all integral values of $c$ with $c \\le 50$ for which the equation $y = x^3 - 7x^2 - cx + 5$ has three rational roots.", "label": "-1"}
{"input": "Find all perfect squares $n$ such that if the positive integer $a \\geqslant 15$ is some divisor of $n$ then $a+15$ is a prime power.", "label": "149164964196"}
{"input": "BoatMaster started building 5 canoes in January of this year. Each subsequent month, they built three times the number of canoes they had built the previous month. How many total canoes were built by BoatMaster by the end of April of this year?", "label": "200"}
{"input": "Given $\\overset{⇀}{a}=\\left(x,2\\right)$, $\\overset{⇀}{b}=\\left(-2,4\\right)$, if $\\overset{⇀}{a}\\parallel\\overset{⇀}{b}$, find $x$.", "label": "-1"}
{"input": "If \\( g(x) = \\frac{x-3}{x^2 + cx + d} \\), and \\( g(x) \\) has vertical asymptotes at \\( x = 2 \\) and \\( x = -1 \\), find the sum of \\( c \\) and \\( d \\).", "label": "-3"}
{"input": "A system sampling method is used to select 32 people from a group of 960 for a questionnaire survey. They are randomly numbered from 1 to 960. After grouping, the number drawn using simple random sampling in the first group is 4. Among the 32 people selected, those whose numbers fall within the interval [1, 400] complete questionnaire A, those whose numbers fall within the interval [401, 720] complete questionnaire B, and the rest complete questionnaire C. Determine the number of people who complete questionnaire C.", "label": "8"}
{"input": "Calculate the last three digits of the sum: $$7! + 14! + 21! + \\cdots + 98!$$", "label": "40"}
{"input": "Consider a grid where each block is 1 unit by 1 unit. You are required to move from point $A$ at the bottom-left corner (0,0) to point $B$ situated at (5,4) in the upper-right corner. The grid has a total of 9 blocks along the 5-unit width and 5 blocks along the 4-unit height. Point $C$ at (2,2) is blocked and cannot be used. How many different 9-step paths can you take from $A$ to $B$, sticking to the right and upward directions only, while avoiding point $C$?", "label": "66"}
{"input": "If the radius of a circular lake is 7 meters (m), what is the diameter of the lake in meters (m)?", "label": "14"}
{"input": "The inhabitants of the Isle of Concatenate use an extended alphabet of 25 letters (A through Y). Each word in their language has a maximum length of 5 letters, and every word must include the letter A at least once. How many such words are possible?", "label": "1863701"}
{"input": "Evaluate the expression: some number + sqrt(-4 + 6 × 4 ÷ 3). The result is 13. What is the missing number?", "label": "11"}
{"input": "Vivian needs to shovel snow off a rectangular section of a park pathway that is 30 feet long and 4 feet wide. Initially, the snow was 1 foot deep across the entire pathway, but due to partial melting, the depth reduced to $\\frac{1}{2}$ foot deep for half of the pathway's length. How many cubic feet of snow does Vivian need to shovel?", "label": "90"}
{"input": "If there exist a real number $a$ and a positive integer $n$, such that $f\\left(x\\right)=\\cos 2x-a\\sin x$ has exactly $2022$ zeros in the interval $\\left(0,n\\pi \\right)$, then the total number of positive integers $n$ that satisfy this condition is ______.", "label": "5"}
{"input": "Delaney has to catch a bus that leaves at 8:00. a.m to school every day. He always takes x minutes to reach the pick-up point from his home. One day he woke up late and left his home at 7:50. How much time did he miss the bus by when he reached the pick-up point?\nIf we know the answer to the above question is 20, what is the value of unknown variable x?", "label": "10"}
{"input": "Janice has been working part-time at a convenience store 5 days a week. She can earn $30 per day and can earn $15 more when she works a 2 hour overtime shift. If she earns $195 this week, how many overtime shifts did she work?", "label": "3"}
{"input": "Let $ \\mathcal{H}_n$ be the set of all numbers of the form $ 2 \\pm\\sqrt{2 \\pm\\sqrt{2 \\pm\\ldots\\pm\\sqrt 2}}$ where \"root signs\" appear $ n$ times.\r\n(a) Prove that all the elements of $ \\mathcal{H}_n$ are real. \r\n(b) Computer the product of the elements of $ \\mathcal{H}_n$.\r\n(c) The elements of $ \\mathcal{H}_{11}$ are arranged in a row, and are sorted by size in an ascending order. Find the position in that row, of the elements of $ \\mathcal{H}_{11}$ that corresponds to the following combination of $ \\pm$ signs: \\[ \\plus{}\\plus{}\\plus{}\\plus{}\\plus{}\\minus{}\\plus{}\\plus{}\\minus{}\\plus{}\\minus{}\\]", "label": "2011"}
{"input": "The following diagram shows a grid of $36$ cells. Find the number of rectangles pictured in the diagram that contain at least three cells of the grid.\n[img]https://cdn.artofproblemsolving.com/attachments/a/4/e9ba3a35204ec68c17a364ebf92cc107eb4d7a.png[/img]", "label": "345"}
{"input": "How many more digits does the base-4 representation of $1024_{10}$ have than the base-9 representation of $1024_{10}$?", "label": "1"}
{"input": "The sequence $\\{a_n\\}$ satisfies: if $\\log_{2}a_{n+1} = 1 + \\log_{2}a_{n}$, and $a_{3} = 10$, then $a_{8} = \\ $.", "label": "320"}
{"input": "Danny is bringing his sailboat out to the ocean. When he uses his 24 square foot sail he goes 50 MPH. When he uses his 12 square foot sail he goes 20 MPH. He plans to travel a certain distance. The bigger sail is 6 hours faster than the smaller one. How many miles does he plan to travel?", "label": "200"}
{"input": "Rationalize the denominator of $\\displaystyle \\frac{1}{\\sqrt{3} + \\sqrt{5} + \\sqrt{11}}$ and write your answer in the form\n\\[\n\\frac{A\\sqrt{3} + B\\sqrt{5} + C\\sqrt{11} + D\\sqrt{E}}{F},\n\\]\nwhere everything is in simplest radical form and the fraction is in lowest terms, and $F$ is positive. What is $A + B + C + D + E + F$?", "label": "97"}
{"input": "Find the least common multiple of 36 and 45.", "label": "180"}
{"input": "While organizing her files, Bianca deleted 5 pictures, 12 songs, 10 text files, and 6 video files. What is the total number of files she deleted?", "label": "33"}
{"input": "Given the curve $y= \\frac {1}{6}x^{2}-1$ and $y=1+x^{3}$ have perpendicular tangents at $x=x_{0}$, find the value of $x_{0}$.", "label": "-1"}
{"input": "Calculate the degree of the polynomial resulting from the expansion of $(3x^5 + 2x^4 - x^2 + 5)(5x^8 - 4x^5 + x - 20) - (x^3 + 2)^6$.", "label": "18"}
{"input": "10. Right triangle $X Y Z$ has right angle at $Y$ and $X Y=228, Y Z=$ 2004. Angle $Y$ is trisected, and the angle trisectors intersect $X Z$ at $P$ and $Q$ so that $X, P, Q, Z$ lie on $X Z$ in that order. Find the value of $(P Y+Y Z)(Q Y+X Y)$.", "label": "1370736"}
{"input": "If Kyle picked a dozen roses from his garden for Mother's Day last year, and this year he was only able to pick half that number, how much would he have to spend at the grocery store to make a bouquet with twice as many roses as last year, if each rose costs $3?", "label": "72"}
{"input": "Find the value at $x = 1$ of a unique polynomial $Q(x)$ of degree $4$ with rational coefficients and leading coefficient $1$, which has $\\sqrt{3} + \\sqrt{7}$ as a root.", "label": "13"}
{"input": "Given the equation $x^{2}-px+q=0$ ($p > 0, q > 0$) with two distinct roots $x_{1}$, $x_{2}$, and the fact that $x_{1}$, $x_{2}$, and $-2$ can be appropriately sorted to form an arithmetic sequence as well as a geometric sequence, find the value of $p \\times q$.", "label": "20"}
{"input": "The temperature fluctuated severely in 1 week of September. They started off with some temperature on Sunday then hit 50 on Monday, 65 on Tuesday, 36 on Wednesday, 82 on Thursday, 72 on Friday and ended the week at 26 on Saturday. The average temperature for that week was 53 degrees. What was the temperature on Sunday?", "label": "40"}
{"input": "Given a hyperbola $C$: $\\frac{x^2}{2}-\\frac{y^2}{b^2}=1\\left(b \\gt 0\\right)$, where the distance from a focus $F$ to the asymptote is $\\sqrt{2}$. $(1)$ Find the equation of the hyperbola $C$; $(2)$ A line $l$ passing through the point $\\left(2,0\\right)$ intersects the right branch of the hyperbola $C$ at points $A$ and $B$. Does there exist a point $N$ on the $x$-axis such that $\\overrightarrow{NA}•\\overrightarrow{NB}$ is a constant value? If yes, find the coordinates of point $N$ and the constant value; if not, explain why.", "label": "-1"}
{"input": "Sahil purchased a machine at Rs 14,000, then got it repaired at some cost, then paid transportation charges of Rs 1,000. He then sold it with a 50% profit for Rs 30,000. How much did the repair cost?", "label": "5000"}
{"input": "2/3 of the boys and 3/4 of the girls of a school participate in a function. The number of participating students is 550. The total number of students in the school is 800. How many of the participating students are girls?", "label": "150"}
{"input": "In the Cartesian coordinate system, given vectors $\\overrightarrow{a}=(1,1)$ and $\\overrightarrow{b}=(2,-1)$.  \n$(1)$ Find $|3\\overrightarrow{a}-\\overrightarrow{b}|$;  \n$(2)$ If $\\overrightarrow{m}=2\\overrightarrow{a}-\\overrightarrow{b}$ and $\\overrightarrow{n}=t\\overrightarrow{a}+\\overrightarrow{b}$, and $\\overrightarrow{m}\\perp \\overrightarrow{n}$, find the value of the real number $t$.", "label": "1"}
{"input": "in assembling a bluetooth device , a factory uses one of two kinds of modules . one module costs $ 10 and the other one , that is cheaper , costs $ 3.5 . the factory holds a $ 45 worth stock of 11 modules . how many of the modules in the stock are of the cheaper kind ?", "label": "1"}
{"input": "Rybnikov I.g.\n\nA store received 20 kg of cheese, and a queue formed. After selling cheese to the next customer, the saleswoman accurately calculates the average weight of the purchase for all the cheese sold and informs how many people the remaining cheese will last if everyone buys exactly this average weight. Could the saleswoman have reported after each of the first 10 customers that the cheese would last exactly 10 more people? If so, how much cheese was left in the store after the first 10 customers?\n\n#", "label": "10"}
{"input": "A man can row upstream at 32 kmph and downstream at 48 kmph. What is the speed of the man in still water?", "label": "40"}
{"input": "When a car's brakes are applied, it travels 9 feet less in each second than the previous second until it comes to a complete stop. The car goes 36 feet in the first second after the brakes are applied. How many feet does the car travel from the time the brakes are applied to the time the car stops?", "label": "90"}
{"input": "Bogdanov I.I.\n\nOn a chessboard, 32 white and 32 black pawns are placed in all squares. A pawn can capture pawns of the opposite color by moving diagonally one square and taking the place of the captured pawn (white pawns can only capture to the right-up and left-up, while black pawns can only capture to the left-down and right-down). Pawns cannot move in any other way. What is the minimum number of pawns that can remain on the board?", "label": "2"}
{"input": "Joel is 5 years old and his dad is 32 years old. At a certain age, Joel's dad will be twice as old as him. How old will Joel be at that time?", "label": "27"}
{"input": "Fred had some green balloons. He gave Sandy 221 of the balloons. He now has 488 green balloons. How many green balloons did Fred have initially?", "label": "709"}
{"input": "There are 20 different books in the 'crazy silly school' series. If you are yet to read some of the books, and you have already read 15 books. How many books are you yet to read?", "label": "5"}
{"input": "Determine how many integer palindromes are between 100 and 1000.", "label": "90"}
{"input": "What is the remainder when 4053 is divided by 23?", "label": "5"}
{"input": "A train covered x km at 40 kmph and another 2x km at 20 kmph. What is the average speed of the train in covering the entire 4x km?", "label": "32"}
{"input": "If \\( f(x) = -\\frac{1}{x} \\), what is \\( f(f(f(f(f(8))))) \\)?", "label": "8"}
{"input": "Given the function $f(x)= \\begin{cases} x+2,x\\leqslant 2015 \\\\ f(x-5),x > 2015 \\end{cases}$, find $f(2019)=$ _____ .", "label": "2016"}
{"input": "In triangle $\\triangle DEF$, point $L$ lies on $EF$ such that $DL$ is an altitude of $\\triangle DEF$. Given that $DE = 15$, $EL = 9$, and $EF = 24$, calculate the area of $\\triangle DEF$.", "label": "144"}
{"input": "What is the smallest number that when increased by 2 is exactly divisible by 12, 30, 48, 74 and 100?", "label": "44398"}
{"input": "Task 1. Determine the value of the numerical expression\n\n$$\n8004^{2}-8003^{2}+8002^{2}-8001^{2}+\\ldots+4^{2}-3^{2}+2^{2}-1^{2}\n$$", "label": "32036010"}
{"input": "Compute the value of the following series:\n\\[\n\\sum_{j = 0}^\\infty \\sum_{k = 0}^\\infty 2^{-2k - 2j - (k + j)^3}.\n\\]", "label": "1"}
{"input": "6. Solve the equation $\\sqrt{\\frac{x-3}{2 x+1}}+2=3 \\sqrt{\\frac{2 x+1}{x-3}}$.", "label": "-4"}
{"input": "We build a tower of $2\\times 1$ dominoes in the following way. First, we place $55$ dominoes on the table such that they cover a $10\\times 11$ rectangle; this is the first story of the tower. We then build every new level with $55$ domioes above the exact same $10\\times 11$ rectangle. The tower is called [i]stable[/i] if for every non-lattice point of the $10\\times 11$ rectangle, we can find a domino that has an inner point above it. How many stories is the lowest [i]stable[/i] tower?", "label": "5"}
{"input": "5. A circle with center $O$ and diameter $|A B|=4 \\text{ cm}$ is given. Draw three tangents to this circle, two at points $A$ and $B$, and the third at a point such that the segment $\\overline{C D}$ between the first two tangents is $5 \\text{ cm}$ long. Explain and describe the procedure.", "label": "1"}
{"input": "A, B, and C invested in a partnership business. A invested Rs. 6300, and B invested Rs. 4200. After a year, the profit was Rs. 12500, and A's share in the profit was Rs. 3750. How much did C invest in the business?", "label": "10500"}
{"input": "Define $x$ **#** $y$ to be $x(y + 2) + 2xy$. What is the value of $4$ **#** $-3$?", "label": "-28"}
{"input": "If taxi fares were $8.00 for the first 1/5 mile and $0.8 for each 1/5 mile thereafter, then the taxi fare for a certain distance ride was $39.2. What was the distance of the ride?", "label": "8"}
{"input": "A car travelling with 5/7 km of its actual speed covers 42 km in 1 hr 40 min 48 sec. What is the actual speed of the car?", "label": "35"}
{"input": "When the graph of $y = 3x^2 - 2x + 5$ is shifted three units to the right, we obtain the graph of $y = ax^2 + bx + c$. Find $a + b + c$.", "label": "21"}
{"input": "Anthony initially has 245 pencils. Kathryn gives him 758 more pencils. In all, Anthony has _____ pencils.", "label": "1003"}
{"input": "In five years, Rehana will be three times as old as Phoebe. If Rehana is currently 25 years old, and Jacob, Rehana's brother, is 3/5 of Phoebe's current age, how old is Jacob now?", "label": "3"}
{"input": "The motion equation of an object is $s(t) = 3 + t^{2}$. Find the instantaneous velocity of the object at $t = 2$.", "label": "4"}
{"input": "Consider the function $y = g(x)$ where $g(x) = \\frac{x^2}{Dx^2 + Ex + F}$, and $D, E, F$ are integers. The graph has vertical asymptotes at $x = -3$ and $x = 2$. It is also given that for all $x > 5$, $g(x) > 0.5$. If additionally, $g(0) = \\frac{1}{4}$, find $D + E + F$.", "label": "-4"}
{"input": "Find the number of moles of Sulfuric acid formed on combining 2 moles of Sulfur trioxide and 2 moles of Water. How many moles of Sulfuric acid are formed?", "label": "2"}
{"input": "A train running at the speed of 60 km/hr crosses a pole in a certain amount of time. The length of the train is 250.00000000000003 meters. How many seconds does it take for the train to cross the pole?", "label": "15"}
{"input": "In a certain company, there are three departments: A, B, and C. The ratio of the number of managers to the number of non-managers in any department must always be greater than 7 : 32. However, department A requires the ratio to be greater than 9 : 33, and department B requires the ratio to be greater than 8 : 34. Additionally, consider part-time non-manager employees to be equivalent to 0.5 full-time non-manager employees when calculating ratios. The company has a policy to maintain a minimum gender ratio of 1 : 2 (male : female) among non-manager employees within each department, and each department must adjust their workforce to account for employee vacations and mandatory overtime. \n\nIf department A has 8 managers, 4 of whom are on vacation, and department B has 6 out of 10 managers working with mandatory overtime, what is the maximum number of non-manager employees (including part-time) in department A, considering the gender ratio requirement and accounting for workforce adjustments due to vacations and mandatory overtime?", "label": "12"}
{"input": "In 5 football games thus far this season, Barry has run for 98, 107, 85, 89, and 91 yards. To keep his season average above a certain number of yards, he needs to gain a minimum of 130 yards this Sunday. What is the average number of yards Barry wants to maintain?", "label": "100"}
{"input": "Mrs. Hilt read 12 books. Each book had 32 chapters in it. How many chapters did Mrs. Hilt read?", "label": "384"}
{"input": "What is the $100^{\\mathrm{th}}$ odd positive integer and find its position in the series of positive integers divisible by 5?", "label": "199"}
{"input": "One. (20 points) In a square with an area of 1, construct a smaller square as follows: divide each side of the unit square into $n$ equal parts, then connect each vertex to the nearest division point of its opposite vertex, as shown in Figure 5. If the area of the smaller square is exactly $\\frac{1}{3281}$, find the value of $n$.", "label": "41"}
{"input": "G1.2 Let $p$ and $q$ be prime numbers that are the two distinct roots of the equation $x^{2}-13 x+R=0$, where $R$ is a real number. If $b=p^{2}+q^{2}$, find the value of $b$.", "label": "125"}
{"input": "Given that $\\{a_n\\}$ is a geometric sequence, if $a_1+a_2=30$, $a_4+a_5=120$, then $a_7+a_8$ equals to ____.", "label": "480"}
{"input": "A 180 metres long train running at the speed of 120 kmph crosses another train running in opposite direction at the speed of 80 kmph in a certain amount of time. The length of the other train is approximately 320.04 metres. How long does it take for the first train to cross the second train?", "label": "9"}
{"input": "In three years, Jack will have a certain multiple of the number of handball trophies Michael has right now. If Michael has 30 trophies right now, and the number of his trophies increases by 100 in three years, they will have a total of 430 trophies altogether after three years. What is the multiple of Michael's current trophies that Jack will have in three years?", "label": "10"}
{"input": "【20】The figure on the right is a deformed red cross, divided into six regions. Now we need to color it using four colors, with the requirement that two adjacent regions (two regions with a common border are called adjacent) must be colored differently. If colors can be reused, then there are ( ) different coloring methods.", "label": "432"}
{"input": "Paityn has some red hats and 24 blue hats. Her friend Zola has 4/5 times as many red hats as Paityn has and twice the number of blue hats. If they combine all the hats together and share them equally between themselves, each gets 54 hats. How many red hats does Paityn have?", "label": "20"}
{"input": "If the three lines $ax+2y+8=0$, $4x+3y-10=0$, and $2x-y=0$ intersect at one point, then the value of the real number $a$ is ______.", "label": "-12"}
{"input": "There are 5 people on the Green Bay High track team. If a relay race is 150 meters long, each team member would have to run _____ meters .", "label": "30"}
{"input": "A boy runs at a constant speed of 18 mph for 3 hours and then increases his pace and covers the next 70 miles at a different average speed. The total duration of his running is 8 hours. What was his average speed during the increased pace?", "label": "14"}
{"input": "If the sum of the 4th term and the 12th term of an arithmetic progression is 24, what is the sum of the first 15 terms of the progression?", "label": "180"}
{"input": "Determine the area, in square units, of a square with the vertices located at \\(E (1, 2)\\), \\(F (1, -3)\\), \\(G (-4, -3)\\), and \\(H (-4, 2)\\).", "label": "25"}
{"input": "Suppose there are 15,000 products, among which 1,000 are defective. If 150 products are randomly sampled for inspection, determine the expected number of defective products found.", "label": "10"}
{"input": "Brenda bakes some cakes a day. She does this for 9 days and then sells half of the cakes. Brenda has 90 cakes left. How many cakes does Brenda bake a day?", "label": "20"}
{"input": "If the remainder is 1, the quotient is 54, and the dividend is 217, what is the divisor?", "label": "4"}
{"input": "[Equilateral (Equiangular) Triangle]\n\n[Properties and Characteristics of a Parallelogram]\n\n[Auxiliary Congruent Triangles]\n\n[Rotation Helps Solve the Problem.\n\nOn the sides $AB, BC$, and $CA$ of an equilateral triangle $ABC$, points $D, E$, and $F$ are chosen respectively such that $DE \\parallel AC$ and $DF \\parallel BC$.\n\nFind the angle between the lines $AE$ and $BF$.\n\n#", "label": "60"}
{"input": "Let $f(x) = \\frac{x + 6}{x}.$  The sequence $(f_n)$ of functions is defined by $f_1 = f$ and\n\\[f_n = f \\circ f_{n - 1}\\]for all $n \\ge X  For example,\n\\[f_2(x) = f(f(x)) = \\frac{\\frac{x + 6}{x} + 6}{\\frac{x + 6}{x}} = \\frac{7x + 6}{x + 6}\\]and\n\\[f_3(x) = f(f_2(x)) = \\frac{\\frac{7x + 6}{x + 6} + 6}{\\frac{7x + 6}{x + 6}} = \\frac{13x + 42}{7x + 6}.\\]Let $S$ be the set of all real numbers $x$ such that\n\\[f_n(x) = x\\]for some positive integer $n.$  Find the number of elements in $S.$\nIf we know the answer to the above question is 2, what is the value of unknown variable X?", "label": "1"}
{"input": "During their stay at Lake Huron and Lake Michigan, they caught a total of some pikes, 40 sturgeons, and 75 herrings. They caught 145 fishes from the two lakes. How many pikes did they catch?", "label": "30"}
{"input": "In quadrilateral $ABCD$, $AB = BC = 15$, $CD = DA = 30$, and $\\angle BDC = 60^\\circ$. Points $M$ and $N$ are the midpoints of $\\overline{BC}$ and $\\overline{DA}$ respectively. Compute $MN$.", "label": "15"}
{"input": "A clothing store has an inventory of 34 ties, 40 belts, 63 black shirts, and some white shirts. The number of jeans in the store is two-thirds of the sum of black and white shirts, and the number of scarves is half the number of the sum of ties and belts. There are 33 more jeans than scarves. How many white shirts are there in the store?", "label": "42"}
{"input": "Ditty can bench $80$ pounds today. Every week, the amount he benches increases by the largest prime factor of the weight he benched in the previous week. For example, since he started benching $80$ pounds, next week he would bench $85$ pounds. What is the minimum number of weeks from today it takes for Ditty to bench at least $2021$ pounds?", "label": "32"}
